In [1]:
import findspark
findspark.init()
findspark.find()
import pyspark
from pyspark.sql import SparkSession
from pyspark import SparkContext, SparkConf
spark = SparkSession.builder.getOrCreate()

In [2]:
df = spark.read.csv('ratings.csv',header=True)

In [8]:
print(f"Rows :{df.count()},\nColumns : {len(df.columns)}")

Rows :100836,
Columns : 4

In [9]:
df.show()

+------+-------+------+---------+
|userId|movieId|rating|timestamp|
+------+-------+------+---------+
|     1|      1|     4|964982703|
|     1|      3|     4|964981247|
|     1|      6|     4|964982224|
|     1|     47|     5|964983815|
|     1|     50|     5|964982931|
|     1|     70|     3|964982400|
|     1|    101|     5|964980868|
|     1|    110|     4|964982176|
|     1|    151|     5|964984041|
|     1|    157|     5|964984100|
|     1|    163|     5|964983650|
|     1|    216|     5|964981208|
|     1|    223|     3|964980985|
|     1|    231|     5|964981179|
|     1|    235|     4|964980908|
|     1|    260|     5|964981680|
|     1|    296|     3|964982967|
|     1|    316|     3|964982310|
|     1|    333|     5|964981179|
|     1|    349|     4|964982563|
+------+-------+------+---------+
only showing top 20 rows

In [10]:
df.dtypes

[('userId', 'string'),
 ('movieId', 'string'),
 ('rating', 'string'),
 ('timestamp', 'string')]

In [11]:
df_pandas = df.toPandas()

In [12]:
df_pandas.head()

  userId movieId rating  timestamp
0      1       1      4  964982703
1      1       3      4  964981247
2      1       6      4  964982224
3      1      47      5  964983815
4      1      50      5  964982931

In [13]:
df_pandas.shape

(100836, 4)

In [14]:
df_pandas.columns

Index(['userId', 'movieId', 'rating', 'timestamp'], dtype='object')

In [15]:
df_pandas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     100836 non-null  object
 1   movieId    100836 non-null  object
 2   rating     100836 non-null  object
 3   timestamp  100836 non-null  object
dtypes: object(4)
memory usage: 3.1+ MB

In [16]:
df_spark = spark.createDataFrame(df_pandas)

In [17]:
df_spark.show()

+------+-------+------+---------+
|userId|movieId|rating|timestamp|
+------+-------+------+---------+
|     1|      1|     4|964982703|
|     1|      3|     4|964981247|
|     1|      6|     4|964982224|
|     1|     47|     5|964983815|
|     1|     50|     5|964982931|
|     1|     70|     3|964982400|
|     1|    101|     5|964980868|
|     1|    110|     4|964982176|
|     1|    151|     5|964984041|
|     1|    157|     5|964984100|
|     1|    163|     5|964983650|
|     1|    216|     5|964981208|
|     1|    223|     3|964980985|
|     1|    231|     5|964981179|
|     1|    235|     4|964980908|
|     1|    260|     5|964981680|
|     1|    296|     3|964982967|
|     1|    316|     3|964982310|
|     1|    333|     5|964981179|
|     1|    349|     4|964982563|
+------+-------+------+---------+
only showing top 20 rows

In [18]:
df.show()

+------+-------+------+---------+
|userId|movieId|rating|timestamp|
+------+-------+------+---------+
|     1|      1|     4|964982703|
|     1|      3|     4|964981247|
|     1|      6|     4|964982224|
|     1|     47|     5|964983815|
|     1|     50|     5|964982931|
|     1|     70|     3|964982400|
|     1|    101|     5|964980868|
|     1|    110|     4|964982176|
|     1|    151|     5|964984041|
|     1|    157|     5|964984100|
|     1|    163|     5|964983650|
|     1|    216|     5|964981208|
|     1|    223|     3|964980985|
|     1|    231|     5|964981179|
|     1|    235|     4|964980908|
|     1|    260|     5|964981680|
|     1|    296|     3|964982967|
|     1|    316|     3|964982310|
|     1|    333|     5|964981179|
|     1|    349|     4|964982563|
+------+-------+------+---------+
only showing top 20 rows

In [19]:
from pyspark.sql.functions import col, when

df.select(col("*"),when(col("rating")==3,col("rating"))).show()

+------+-------+------+---------+--------------------------------------+
|userId|movieId|rating|timestamp|CASE WHEN (rating = 3) THEN rating END|
+------+-------+------+---------+--------------------------------------+
|     1|      1|     4|964982703|                                  null|
|     1|      3|     4|964981247|                                  null|
|     1|      6|     4|964982224|                                  null|
|     1|     47|     5|964983815|                                  null|
|     1|     50|     5|964982931|                                  null|
|     1|     70|     3|964982400|                                     3|
|     1|    101|     5|964980868|                                  null|
|     1|    110|     4|964982176|                                  null|
|     1|    151|     5|964984041|                                  null|
|     1|    157|     5|964984100|                                  null|
|     1|    163|     5|964983650|                                  null|
|     1|    216|     5|964981208|                                  null|
|     1|    223|     3|964980985|                                     3|
|     1|    231|     5|964981179|                                  null|
|     1|    235|     4|964980908|                                  null|
|     1|    260|     5|964981680|                                  null|
|     1|    296|     3|964982967|                                     3|
|     1|    316|     3|964982310|                                     3|
|     1|    333|     5|964981179|                                  null|
|     1|    349|     4|964982563|                                  null|
+------+-------+------+---------+--------------------------------------+
only showing top 20 rows

In [20]:
df.select("rating").distinct().show()

+------+
|rating|
+------+
|     3|
|   4.5|
|   2.5|
|     5|
|   3.5|
|   0.5|
|   1.5|
|     1|
|     4|
|     2|
+------+

In [25]:
df.select(col("movieId"),when(col("rating")==3,col("rating")).alias("3 * rating")).show()

+-------+----------+
|movieId|3 * rating|
+-------+----------+
|      1|      null|
|      3|      null|
|      6|      null|
|     47|      null|
|     50|      null|
|     70|         3|
|    101|      null|
|    110|      null|
|    151|      null|
|    157|      null|
|    163|      null|
|    216|      null|
|    223|         3|
|    231|      null|
|    235|      null|
|    260|      null|
|    296|         3|
|    316|         3|
|    333|      null|
|    349|      null|
+-------+----------+
only showing top 20 rows

In [26]:
df.columns

['userId', 'movieId', 'rating', 'timestamp']

In [27]:
df.select(col("*"),when(col("rating")==3,col("movieId")).alias("3 * movie rating")).show()

+------+-------+------+---------+----------------+
|userId|movieId|rating|timestamp|3 * movie rating|
+------+-------+------+---------+----------------+
|     1|      1|     4|964982703|            null|
|     1|      3|     4|964981247|            null|
|     1|      6|     4|964982224|            null|
|     1|     47|     5|964983815|            null|
|     1|     50|     5|964982931|            null|
|     1|     70|     3|964982400|              70|
|     1|    101|     5|964980868|            null|
|     1|    110|     4|964982176|            null|
|     1|    151|     5|964984041|            null|
|     1|    157|     5|964984100|            null|
|     1|    163|     5|964983650|            null|
|     1|    216|     5|964981208|            null|
|     1|    223|     3|964980985|             223|
|     1|    231|     5|964981179|            null|
|     1|    235|     4|964980908|            null|
|     1|    260|     5|964981680|            null|
|     1|    296|     3|964982967|             296|
|     1|    316|     3|964982310|             316|
|     1|    333|     5|964981179|            null|
|     1|    349|     4|964982563|            null|
+------+-------+------+---------+----------------+
only showing top 20 rows

In [29]:
df.select(col("movieId"),when(col("rating")==3,col("rating")).when(col("rating")==4,col("rating")).alias("3* 4* rating")).show()

+-------+------------+
|movieId|3* 4* rating|
+-------+------------+
|      1|           4|
|      3|           4|
|      6|           4|
|     47|        null|
|     50|        null|
|     70|           3|
|    101|        null|
|    110|           4|
|    151|        null|
|    157|        null|
|    163|        null|
|    216|        null|
|    223|           3|
|    231|        null|
|    235|           4|
|    260|        null|
|    296|           3|
|    316|           3|
|    333|        null|
|    349|           4|
+-------+------------+
only showing top 20 rows

In [30]:
df.select(col("movieId"),when(col("rating")==3,col("rating")).when(col("rating")==4,col("rating")).otherwise("0").alias("3* 4* rating")).show()

+-------+------------+
|movieId|3* 4* rating|
+-------+------------+
|      1|           4|
|      3|           4|
|      6|           4|
|     47|           0|
|     50|           0|
|     70|           3|
|    101|           0|
|    110|           4|
|    151|           0|
|    157|           0|
|    163|           0|
|    216|           0|
|    223|           3|
|    231|           0|
|    235|           4|
|    260|           0|
|    296|           3|
|    316|           3|
|    333|           0|
|    349|           4|
+-------+------------+
only showing top 20 rows

In [31]:
from pyspark.sql.functions import count,col

In [34]:
df.groupBy('rating').agg(count("*").alias("* rating count")).show()

+------+--------------+
|rating|* rating count|
+------+--------------+
|     3|         20047|
|   4.5|          8551|
|   2.5|          5550|
|     5|         13211|
|   3.5|         13136|
|   0.5|          1370|
|   1.5|          1791|
|     1|          2811|
|     4|         26818|
|     2|          7551|
+------+--------------+

In [35]:
df.columns

['userId', 'movieId', 'rating', 'timestamp']

In [36]:
import pyspark.sql.functions as F

df.groupBy('userId').agg(F.max('rating').alias('rating_cnt')).show()

+------+----------+
|userId|rating_cnt|
+------+----------+
|   296|         5|
|   467|         5|
|   125|         5|
|   451|         5|
|   124|         5|
|   447|         5|
|    51|         5|
|   591|         5|
|     7|         5|
|   307|         5|
|   475|         5|
|   574|         5|
|   169|         5|
|   205|         5|
|   334|       4.5|
|   544|         5|
|   577|         5|
|   581|         5|
|   272|         5|
|   442|       2.5|
+------+----------+
only showing top 20 rows

In [37]:
df.createOrReplaceTempView('table')

In [38]:
spark.sql('select userId, max(rating) as max_rating from table group by userId').show()

+------+----------+
|userId|max_rating|
+------+----------+
|   296|         5|
|   467|         5|
|   125|         5|
|   451|         5|
|   124|         5|
|   447|         5|
|    51|         5|
|   591|         5|
|     7|         5|
|   307|         5|
|   475|         5|
|   574|         5|
|   169|         5|
|   205|         5|
|   334|       4.5|
|   544|         5|
|   577|         5|
|   581|         5|
|   272|         5|
|   442|       2.5|
+------+----------+
only showing top 20 rows

In [39]:
spark.sql("select userId, count(*) as count from table group by userId").show()

+------+-----+
|userId|count|
+------+-----+
|   296|   27|
|   467|   22|
|   125|  360|
|   451|   34|
|     7|  152|
|    51|  359|
|   124|   50|
|   447|   78|
|   591|   54|
|   307|  975|
|   475|  155|
|   574|   23|
|   169|  269|
|   205|   27|
|   334|  154|
|   544|   22|
|   577|  161|
|   581|   40|
|   272|   31|
|   442|   20|
+------+-----+
only showing top 20 rows

In [40]:
df_place = spark.read.csv('Placement_Data_Full_Class.csv',header=True)
df_place.show()

+-----+------+-----+-------+-----+-------+--------+--------+---------+------+-------+--------------+-----+----------+------+
|sl_no|gender|ssc_p|  ssc_b|hsc_p|  hsc_b|   hsc_s|degree_p| degree_t|workex|etest_p|specialisation|mba_p|    status|salary|
+-----+------+-----+-------+-----+-------+--------+--------+---------+------+-------+--------------+-----+----------+------+
|    1|     M|67.00| Others|91.00| Others|Commerce|   58.00| Sci&Tech|    No|     55|        Mkt&HR| 58.8|    Placed|270000|
|    2|     M|79.33|Central|78.33| Others| Science|   77.48| Sci&Tech|   Yes|   86.5|       Mkt&Fin|66.28|    Placed|200000|
|    3|     M|65.00|Central|68.00|Central|    Arts|   64.00|Comm&Mgmt|    No|     75|       Mkt&Fin| 57.8|    Placed|250000|
|    4|     M|56.00|Central|52.00|Central| Science|   52.00| Sci&Tech|    No|     66|        Mkt&HR|59.43|Not Placed|  null|
|    5|     M|85.80|Central|73.60|Central|Commerce|   73.30|Comm&Mgmt|    No|   96.8|       Mkt&Fin| 55.5|    Placed|425000|
|    6|     M|55.00| Others|49.80| Others| Science|   67.25| Sci&Tech|   Yes|     55|       Mkt&Fin|51.58|Not Placed|  null|
|    7|     F|46.00| Others|49.20| Others|Commerce|   79.00|Comm&Mgmt|    No|  74.28|       Mkt&Fin|53.29|Not Placed|  null|
|    8|     M|82.00|Central|64.00|Central| Science|   66.00| Sci&Tech|   Yes|     67|       Mkt&Fin|62.14|    Placed|252000|
|    9|     M|73.00|Central|79.00|Central|Commerce|   72.00|Comm&Mgmt|    No|  91.34|       Mkt&Fin|61.29|    Placed|231000|
|   10|     M|58.00|Central|70.00|Central|Commerce|   61.00|Comm&Mgmt|    No|     54|       Mkt&Fin|52.21|Not Placed|  null|
|   11|     M|58.00|Central|61.00|Central|Commerce|   60.00|Comm&Mgmt|   Yes|     62|        Mkt&HR|60.85|    Placed|260000|
|   12|     M|69.60|Central|68.40|Central|Commerce|   78.30|Comm&Mgmt|   Yes|     60|       Mkt&Fin| 63.7|    Placed|250000|
|   13|     F|47.00|Central|55.00| Others| Science|   65.00|Comm&Mgmt|    No|     62|        Mkt&HR|65.04|Not Placed|  null|
|   14|     F|77.00|Central|87.00|Central|Commerce|   59.00|Comm&Mgmt|    No|     68|       Mkt&Fin|68.63|    Placed|218000|
|   15|     M|62.00|Central|47.00|Central|Commerce|   50.00|Comm&Mgmt|    No|     76|        Mkt&HR|54.96|Not Placed|  null|
|   16|     F|65.00|Central|75.00|Central|Commerce|   69.00|Comm&Mgmt|   Yes|     72|       Mkt&Fin|64.66|    Placed|200000|
|   17|     M|63.00|Central|66.20|Central|Commerce|   65.60|Comm&Mgmt|   Yes|     60|       Mkt&Fin|62.54|    Placed|300000|
|   18|     F|55.00|Central|67.00|Central|Commerce|   64.00|Comm&Mgmt|    No|     60|       Mkt&Fin|67.28|Not Placed|  null|
|   19|     F|63.00|Central|66.00|Central|Commerce|   64.00|Comm&Mgmt|    No|     68|        Mkt&HR|64.08|Not Placed|  null|
|   20|     M|60.00| Others|67.00| Others|    Arts|   70.00|Comm&Mgmt|   Yes|  50.48|       Mkt&Fin|77.89|    Placed|236000|
+-----+------+-----+-------+-----+-------+--------+--------+---------+------+-------+--------------+-----+----------+------+
only showing top 20 rows

In [41]:
df_place.dtypes

[('sl_no', 'string'),
 ('gender', 'string'),
 ('ssc_p', 'string'),
 ('ssc_b', 'string'),
 ('hsc_p', 'string'),
 ('hsc_b', 'string'),
 ('hsc_s', 'string'),
 ('degree_p', 'string'),
 ('degree_t', 'string'),
 ('workex', 'string'),
 ('etest_p', 'string'),
 ('specialisation', 'string'),
 ('mba_p', 'string'),
 ('status', 'string'),
 ('salary', 'string')]

In [43]:
from pyspark.sql.types import IntegerType

df_place = df_place.withColumn('salary',df_place['salary'].cast(IntegerType()))

In [45]:
df_place.dtypes

[('sl_no', 'string'),
 ('gender', 'string'),
 ('ssc_p', 'string'),
 ('ssc_b', 'string'),
 ('hsc_p', 'string'),
 ('hsc_b', 'string'),
 ('hsc_s', 'string'),
 ('degree_p', 'string'),
 ('degree_t', 'string'),
 ('workex', 'string'),
 ('etest_p', 'string'),
 ('specialisation', 'string'),
 ('mba_p', 'string'),
 ('status', 'string'),
 ('salary', 'int')]

In [47]:
df_place.select('hsc_s').distinct().show()

+--------+
|   hsc_s|
+--------+
| Science|
|Commerce|
|    Arts|
+--------+

In [48]:
df_place.groupBy('gender').pivot('hsc_s').sum('salary').show()

+------+-------+--------+--------+
|gender|   Arts|Commerce| Science|
+------+-------+--------+--------+
|     F|1006000| 6210000| 5614000|
|     M| 486000|16496000|12909000|
+------+-------+--------+--------+

In [49]:
df_place.columns

['sl_no',
 'gender',
 'ssc_p',
 'ssc_b',
 'hsc_p',
 'hsc_b',
 'hsc_s',
 'degree_p',
 'degree_t',
 'workex',
 'etest_p',
 'specialisation',
 'mba_p',
 'status',
 'salary']

In [51]:
df_place = df_place.withColumn('ssc_p',df_place['ssc_p'].cast(IntegerType())).withColumn('hsc_p',df_place['hsc_p'].cast(IntegerType())).withColumn('degree_p',df_place['degree_p'].cast(IntegerType())).withColumn('etest_p',df_place['etest_p'].cast(IntegerType())).withColumn('mba_p',df_place['mba_p'].cast(IntegerType()))

In [52]:
df.dtypes

[('userId', 'string'),
 ('movieId', 'string'),
 ('rating', 'string'),
 ('timestamp', 'string')]

In [53]:
df_place.dtypes

[('sl_no', 'string'),
 ('gender', 'string'),
 ('ssc_p', 'int'),
 ('ssc_b', 'string'),
 ('hsc_p', 'int'),
 ('hsc_b', 'string'),
 ('hsc_s', 'string'),
 ('degree_p', 'int'),
 ('degree_t', 'string'),
 ('workex', 'string'),
 ('etest_p', 'int'),
 ('specialisation', 'string'),
 ('mba_p', 'int'),
 ('status', 'string'),
 ('salary', 'int')]

In [54]:
df1 = df_place.rdd.map(lambda x: (x.gender,x.ssc_p,x.hsc_p))

In [55]:
type(df1)

pyspark.rdd.PipelinedRDD

In [56]:
print(df1.take(10))

[('M', 67, 91), ('M', 79, 78), ('M', 65, 68), ('M', 56, 52), ('M', 85, 73), ('M', 55, 49), ('F', 46, 49), ('M', 82, 64), ('M', 73, 79), ('M', 58, 70)]

In [57]:
sch = ['gender','ssc_p','hsc_p']

df2 = df_place.rdd.map(lambda x: (x.gender,x.ssc_p+2,x.hsc_p)).toDF(sch)

In [58]:
type(df2)

pyspark.sql.dataframe.DataFrame

In [59]:
df2.show()

+------+-----+-----+
|gender|ssc_p|hsc_p|
+------+-----+-----+
|     M|   69|   91|
|     M|   81|   78|
|     M|   67|   68|
|     M|   58|   52|
|     M|   87|   73|
|     M|   57|   49|
|     F|   48|   49|
|     M|   84|   64|
|     M|   75|   79|
|     M|   60|   70|
|     M|   60|   61|
|     M|   71|   68|
|     F|   49|   55|
|     F|   79|   87|
|     M|   64|   47|
|     F|   67|   75|
|     M|   65|   66|
|     F|   57|   67|
|     F|   65|   66|
|     M|   62|   67|
+------+-----+-----+
only showing top 20 rows

In [60]:
df_average = df_place.rdd.map(lambda x: (x.sl_no,x.gender,(x.ssc_p+x.hsc_p)/2)).toDF(['serial_no','gender','average'])

In [61]:
df_average.show()

+---------+------+-------+
|serial_no|gender|average|
+---------+------+-------+
|        1|     M|   79.0|
|        2|     M|   78.5|
|        3|     M|   66.5|
|        4|     M|   54.0|
|        5|     M|   79.0|
|        6|     M|   52.0|
|        7|     F|   47.5|
|        8|     M|   73.0|
|        9|     M|   76.0|
|       10|     M|   64.0|
|       11|     M|   59.5|
|       12|     M|   68.5|
|       13|     F|   51.0|
|       14|     F|   82.0|
|       15|     M|   54.5|
|       16|     F|   70.0|
|       17|     M|   64.5|
|       18|     F|   61.0|
|       19|     F|   64.5|
|       20|     M|   63.5|
+---------+------+-------+
only showing top 20 rows

In [62]:
df_add = spark.read.csv('sample_address.csv',header=True)

In [64]:
df_add.show()

+------+-------------------+--------------------+
|Emp_Id|               Name|             Address|
+------+-------------------+--------------------+
|  1001|      Rahul Tewatia|220 Bapat street;...|
|  1002|  Aarav Shrivastava|Abhyankar street;...|
|  1003|     Harshad Badani|Abhyankar street;...|
|  1004|      Deepak Saxena|Anand street;Mang...|
|  1005|      Shalini Singh|Vip Road;Daya kun...|
|  1006|  Manoj Shrivastava|Mandir Road;C-23 ...|
|  1007|           MS Dhoni|Abhyankar street;...|
|  1008|      Setu Upadhyay|Zuzuvadi Road;Zol...|
|  1009|  Kiaan Shrivastava|Abhyankar street;...|
|  1010|Paridhi Shrivastava|Abhyankar street;...|
+------+-------------------+--------------------+

In [65]:
split_col_name = F.split(df_add['Name'],' ')

df_add = df_add.withColumn('First_name',split_col_name.getItem(0))
df_add = df_add.withColumn('Surname',split_col_name.getItem(1))

split_col_address = F.split(df_add['Address'],';')

df_add = df_add.withColumn('Street',split_col_address.getItem(0))
df_add = df_add.withColumn('Apartment',split_col_address.getItem(1))
df_add = df_add.withColumn('Suburb',split_col_address.getItem(2))
df_add = df_add.withColumn('City',split_col_address.getItem(3))
df_add = df_add.withColumn('ZipCode',split_col_address.getItem(4))

In [66]:
df_add = df_add.drop('Name','Address')

In [67]:
df_add.show()

+------+----------+-----------+----------------+--------------------+------------+---------+-------+
|Emp_Id|First_name|    Surname|          Street|           Apartment|      Suburb|     City|ZipCode|
+------+----------+-----------+----------------+--------------------+------------+---------+-------+
|  1001|     Rahul|    Tewatia|220 Bapat street|   Radhika Apartment|       Wakad|     Pune| 311057|
|  1002|     Aarav|Shrivastava|Abhyankar street|shree Palace Apar...|    Dhantoli|   Nagpur| 440012|
|  1003|   Harshad|     Badani|Abhyankar street|     shree Apartment|    Dhantoli|   Nagpur| 440012|
|  1004|    Deepak|     Saxena|    Anand street|    Mangal Apartment|Rohini Nagar|     Kota| 450112|
|  1005|   Shalini|      Singh|        Vip Road|    Daya kunj bangla|    MP Nagar|   Bhopal| 410256|
|  1006|     Manoj|Shrivastava|     Mandir Road|   C-23 Kachnar City| Vijay Nagar| Jabalpur| 440057|
|  1007|        MS|      Dhoni|Abhyankar street|shree Palace Apar...| Dhant Nagar|   Ranchi| 440612|
|  1008|      Setu|   Upadhyay|   Zuzuvadi Road|      Zolo Hibiscous|  BTM Layout|Bangalore| 441012|
|  1009|     Kiaan|Shrivastava|Abhyankar street|shree Palace Apar...|    Dhantoli|   Mumbai| 442012|
|  1010|   Paridhi|Shrivastava|Abhyankar street|shree Palace Apar...|    Dhantoli|   Jaipur| 443012|
+------+----------+-----------+----------------+--------------------+------------+---------+-------+

In [69]:
df_add.filter(df_add.Surname.like('Shri%')).show()

+------+----------+-----------+----------------+--------------------+-----------+--------+-------+
|Emp_Id|First_name|    Surname|          Street|           Apartment|     Suburb|    City|ZipCode|
+------+----------+-----------+----------------+--------------------+-----------+--------+-------+
|  1002|     Aarav|Shrivastava|Abhyankar street|shree Palace Apar...|   Dhantoli|  Nagpur| 440012|
|  1006|     Manoj|Shrivastava|     Mandir Road|   C-23 Kachnar City|Vijay Nagar|Jabalpur| 440057|
|  1009|     Kiaan|Shrivastava|Abhyankar street|shree Palace Apar...|   Dhantoli|  Mumbai| 442012|
|  1010|   Paridhi|Shrivastava|Abhyankar street|shree Palace Apar...|   Dhantoli|  Jaipur| 443012|
+------+----------+-----------+----------------+--------------------+-----------+--------+-------+

In [70]:
df_add.filter(df_add.Surname.isin('Dhoni','Singh')).show()

+------+----------+-------+----------------+--------------------+-----------+------+-------+
|Emp_Id|First_name|Surname|          Street|           Apartment|     Suburb|  City|ZipCode|
+------+----------+-------+----------------+--------------------+-----------+------+-------+
|  1005|   Shalini|  Singh|        Vip Road|    Daya kunj bangla|   MP Nagar|Bhopal| 410256|
|  1007|        MS|  Dhoni|Abhyankar street|shree Palace Apar...|Dhant Nagar|Ranchi| 440612|
+------+----------+-------+----------------+--------------------+-----------+------+-------+

In [74]:
df_add.withColumn('Full Name',F.concat(df_add['First_name'],F.lit(' '),df_add.Surname)).show()

+------+----------+-----------+----------------+--------------------+------------+---------+-------+-------------------+
|Emp_Id|First_name|    Surname|          Street|           Apartment|      Suburb|     City|ZipCode|          Full Name|
+------+----------+-----------+----------------+--------------------+------------+---------+-------+-------------------+
|  1001|     Rahul|    Tewatia|220 Bapat street|   Radhika Apartment|       Wakad|     Pune| 311057|      Rahul Tewatia|
|  1002|     Aarav|Shrivastava|Abhyankar street|shree Palace Apar...|    Dhantoli|   Nagpur| 440012|  Aarav Shrivastava|
|  1003|   Harshad|     Badani|Abhyankar street|     shree Apartment|    Dhantoli|   Nagpur| 440012|     Harshad Badani|
|  1004|    Deepak|     Saxena|    Anand street|    Mangal Apartment|Rohini Nagar|     Kota| 450112|      Deepak Saxena|
|  1005|   Shalini|      Singh|        Vip Road|    Daya kunj bangla|    MP Nagar|   Bhopal| 410256|      Shalini Singh|
|  1006|     Manoj|Shrivastava|     Mandir Road|   C-23 Kachnar City| Vijay Nagar| Jabalpur| 440057|  Manoj Shrivastava|
|  1007|        MS|      Dhoni|Abhyankar street|shree Palace Apar...| Dhant Nagar|   Ranchi| 440612|           MS Dhoni|
|  1008|      Setu|   Upadhyay|   Zuzuvadi Road|      Zolo Hibiscous|  BTM Layout|Bangalore| 441012|      Setu Upadhyay|
|  1009|     Kiaan|Shrivastava|Abhyankar street|shree Palace Apar...|    Dhantoli|   Mumbai| 442012|  Kiaan Shrivastava|
|  1010|   Paridhi|Shrivastava|Abhyankar street|shree Palace Apar...|    Dhantoli|   Jaipur| 443012|Paridhi Shrivastava|
+------+----------+-----------+----------------+--------------------+------------+---------+-------+-------------------+

In [78]:
df_add.withColumn('Street',F.regexp_replace('Street','street','st')).show()

+------+----------+-----------+-------------+--------------------+------------+---------+-------+
|Emp_Id|First_name|    Surname|       Street|           Apartment|      Suburb|     City|ZipCode|
+------+----------+-----------+-------------+--------------------+------------+---------+-------+
|  1001|     Rahul|    Tewatia| 220 Bapat st|   Radhika Apartment|       Wakad|     Pune| 311057|
|  1002|     Aarav|Shrivastava| Abhyankar st|shree Palace Apar...|    Dhantoli|   Nagpur| 440012|
|  1003|   Harshad|     Badani| Abhyankar st|     shree Apartment|    Dhantoli|   Nagpur| 440012|
|  1004|    Deepak|     Saxena|     Anand st|    Mangal Apartment|Rohini Nagar|     Kota| 450112|
|  1005|   Shalini|      Singh|     Vip Road|    Daya kunj bangla|    MP Nagar|   Bhopal| 410256|
|  1006|     Manoj|Shrivastava|  Mandir Road|   C-23 Kachnar City| Vijay Nagar| Jabalpur| 440057|
|  1007|        MS|      Dhoni| Abhyankar st|shree Palace Apar...| Dhant Nagar|   Ranchi| 440612|
|  1008|      Setu|   Upadhyay|Zuzuvadi Road|      Zolo Hibiscous|  BTM Layout|Bangalore| 441012|
|  1009|     Kiaan|Shrivastava| Abhyankar st|shree Palace Apar...|    Dhantoli|   Mumbai| 442012|
|  1010|   Paridhi|Shrivastava| Abhyankar st|shree Palace Apar...|    Dhantoli|   Jaipur| 443012|
+------+----------+-----------+-------------+--------------------+------------+---------+-------+

In [79]:
df_add.show()

+------+----------+-----------+----------------+--------------------+------------+---------+-------+
|Emp_Id|First_name|    Surname|          Street|           Apartment|      Suburb|     City|ZipCode|
+------+----------+-----------+----------------+--------------------+------------+---------+-------+
|  1001|     Rahul|    Tewatia|220 Bapat street|   Radhika Apartment|       Wakad|     Pune| 311057|
|  1002|     Aarav|Shrivastava|Abhyankar street|shree Palace Apar...|    Dhantoli|   Nagpur| 440012|
|  1003|   Harshad|     Badani|Abhyankar street|     shree Apartment|    Dhantoli|   Nagpur| 440012|
|  1004|    Deepak|     Saxena|    Anand street|    Mangal Apartment|Rohini Nagar|     Kota| 450112|
|  1005|   Shalini|      Singh|        Vip Road|    Daya kunj bangla|    MP Nagar|   Bhopal| 410256|
|  1006|     Manoj|Shrivastava|     Mandir Road|   C-23 Kachnar City| Vijay Nagar| Jabalpur| 440057|
|  1007|        MS|      Dhoni|Abhyankar street|shree Palace Apar...| Dhant Nagar|   Ranchi| 440612|
|  1008|      Setu|   Upadhyay|   Zuzuvadi Road|      Zolo Hibiscous|  BTM Layout|Bangalore| 441012|
|  1009|     Kiaan|Shrivastava|Abhyankar street|shree Palace Apar...|    Dhantoli|   Mumbai| 442012|
|  1010|   Paridhi|Shrivastava|Abhyankar street|shree Palace Apar...|    Dhantoli|   Jaipur| 443012|
+------+----------+-----------+----------------+--------------------+------------+---------+-------+

In [83]:
df_add.withColumn('Apartment',F.regexp_replace(F.lower(df_add['Apartment']),'shree','SHRI')).show()

+------+----------+-----------+----------------+--------------------+------------+---------+-------+
|Emp_Id|First_name|    Surname|          Street|           Apartment|      Suburb|     City|ZipCode|
+------+----------+-----------+----------------+--------------------+------------+---------+-------+
|  1001|     Rahul|    Tewatia|220 Bapat street|   radhika apartment|       Wakad|     Pune| 311057|
|  1002|     Aarav|Shrivastava|Abhyankar street|SHRI palace apart...|    Dhantoli|   Nagpur| 440012|
|  1003|   Harshad|     Badani|Abhyankar street|      SHRI apartment|    Dhantoli|   Nagpur| 440012|
|  1004|    Deepak|     Saxena|    Anand street|    mangal apartment|Rohini Nagar|     Kota| 450112|
|  1005|   Shalini|      Singh|        Vip Road|    daya kunj bangla|    MP Nagar|   Bhopal| 410256|
|  1006|     Manoj|Shrivastava|     Mandir Road|   c-23 kachnar city| Vijay Nagar| Jabalpur| 440057|
|  1007|        MS|      Dhoni|Abhyankar street|SHRI palace apart...| Dhant Nagar|   Ranchi| 440612|
|  1008|      Setu|   Upadhyay|   Zuzuvadi Road|      zolo hibiscous|  BTM Layout|Bangalore| 441012|
|  1009|     Kiaan|Shrivastava|Abhyankar street|SHRI palace apart...|    Dhantoli|   Mumbai| 442012|
|  1010|   Paridhi|Shrivastava|Abhyankar street|SHRI palace apart...|    Dhantoli|   Jaipur| 443012|
+------+----------+-----------+----------------+--------------------+------------+---------+-------+